<h1>Необходимые документы</h1>
<p>Перечень стандартных документов (минимальный учебный пример):</p>
<ul class="card-list">
    <li>Загранпаспорт.</li>
    <li>Свидетельство о рождении.</li>
    <li>Справка о несудимости.</li>
    <li>Документы, подтверждающие легальное пребывание в США.</li>
    <li>Фотографии установленного образца.</li>

<h3>Требования для получения американского паспорта</h3>
    <p>    
        Любой человек, родившийся на территории США, автоматически становится американским гражданином — это относится и к детям иностранцев, в том числе иммигрантов без легального статуса.

        Если же вы родились в РФ или другом государстве, вам нужно пройти процесс натурализации. О способах получить гражданство США чуть ниже, а здесь — общие требования к тем, кто желает стать американцем:

        Возраст 21+;
        Пребывание в стране с Грин-картой от 3 до 5 лет(в зависимости от основания, на котором вы ее получили);
        Отсутствие судимостей;
        Проживание в округе, где подается заявка на гражданство, последние 90 дней;
        Тест на натурализацию (включает проверку знания английского языка, истории и законов);
        Принятие присяги.
    </p>
</ul>
